{
  "title": "Clarify Your Goals",
  "intro": {
    "title": "Identify Your Interpersonal Goals",
    "description": "Before any interpersonal interaction, it's important to clarify what you want to achieve. Identify your objectives, relationship, and self-respect goals, then rank them by importance for your current situation."
  },
  "sections": [
    {
      "id": "objectiveEffectiveness",
      "title": "Objective Effectiveness",
      "placeholder": "What outcome do you want? What specific result or outcome are you hoping to achieve from this interaction?"
    },
    {
      "id": "relationshipEffectiveness",
      "title": "Relationship Effectiveness",
      "placeholder": "What do you want for the relationship from this interaction? How do you want this interaction to affect your relationship with the other person?"
    },
    {
      "id": "selfRespect",
      "title": "Self-Respect",
      "placeholder": "How do you want to feel about yourself afterward? What do you need to do or say to feel good about yourself and maintain your self-respect?"
    },
    {
      "id": "relationshipMindfulness",
      "title": "Relationship Mindfulness",
      "placeholder": "What do you want to stay aware of about the relationship as you talk? What aspects of your relationship do you want to keep in mind during this conversation?"
    },
    {
      "id": "rankGoals",
      "title": "Rank Your Goals",
      "placeholder": "",
      "subsections": [
        {
          "id": "mostImportant",
          "title": "Most Important Goal",
          "placeholder": "Which goal is most important to you in this situation? Explain why this goal matters most to you right now."
        },
        {
          "id": "secondImportant",
          "title": "Second Most Important Goal",
          "placeholder": "Which goal is your second priority? Explain why this goal is your second priority."
        },
        {
          "id": "leastImportant",
          "title": "Least Important Goal",
          "placeholder": "Which goal is least important in this situation? Why is this goal less of a priority for you right now?"
        }
      ]
    },
    {
      "id": "reflectOnPriorities",
      "title": "Reflect on Your Priorities",
      "placeholder": "",
      "subsections": [
        {
          "id": "whyPriorities",
          "title": "Why These Priorities?",
          "placeholder": "What factors influenced your ranking? What circumstances, values, or needs led you to prioritize these goals in this way?"
        },
        {
          "id": "howToCommunicate",
          "title": "How Will You Communicate?",
          "placeholder": "Based on your priorities, how will you approach this conversation? Given your most important goal, what approach, tone, or strategy will help you achieve it?"
        }
      ]
    }
  ],
  "buttons": {
    "save": "Save",
    "viewSaved": "View Saved",
    "backToMenu": "Back to Menu"
  }
}
